-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\delamb\data\nlsy97Subset02\logs\log_2018.09.10_22.40.15.txt
  log type:  text
 opened on:  10 Sep 2018, 22:40:15

. cd ..
C:\Users\delamb\data\nlsy97Subset02

. 
. 
. ********************************
. ** MENTAL HEALTH SCORE CODING **
. ********************************
. 
. * Recode depression/anxiety scales as 0=Lowest to 3=Highest
. foreach var of varlist ysaq_282c_* ysaq_282e_* ysaq_282g_* {
  2.     recode `var' (-5/-1 = .) (1 = 3) (3 = 1) (4 = 0)
  3.     label values `var'
  4. }
(ysaq_282c_2000: 8289 changes made)
(ysaq_282c_2002: 8146 changes made)
(ysaq_282c_2004: 8423 changes made)
(ysaq_282c_2006: 8449 changes made)
(ysaq_282c_2008: 8332 changes made)
(ysaq_282e_2000: 8074 changes made)
(ysaq_282e_2002: 8155 changes made)
(ysaq_282e_2004: 8296 changes made)
(ysaq_282e_2006: 8379 changes made)
(ysaq_282e_2008: 8330 changes made)
(ysaq_282g_2000: 8527 changes made)
(ysaq_282g_2002: 8575 changes made)
(ysaq_282g_2004: 8669 changes made)
(ysaq_282g_2006: 8710 changes made)
(ysaq_282g_2008: 8727 changes made)

. 
. * Recode happiness/calmness scales as 0=Highest to 3=Lowest
. foreach var of varlist ysaq_282d_* ysaq_282f_* {
  2.     recode `var' (-5/-1 = .) (1 = 0) (2 = 1) (3 = 2) (4 = 3)
  3.     label values `var'
  4. }
(ysaq_282d_2000: 8984 changes made)
(ysaq_282d_2002: 8984 changes made)
(ysaq_282d_2004: 8984 changes made)
(ysaq_282d_2006: 8984 changes made)
(ysaq_282d_2008: 8984 changes made)
(ysaq_282f_2000: 8984 changes made)
(ysaq_282f_2002: 8984 changes made)
(ysaq_282f_2004: 8984 changes made)
(ysaq_282f_2006: 8984 changes made)
(ysaq_282f_2008: 8984 changes made)

. 
. * Sum all mental health scales. 0 = Lower depression/anxiety symptoms, 17 = Higher d/a symptoms
. forvalues i = 2000(2)2008 {
  2.     gen mhscore`i' = ysaq_282c_`i' + ysaq_282d_`i' + ysaq_282e_`i' + ysaq_282f_`i' + ysaq_282g_`i'
  3. }
(965 missing values generated)
(1,119 missing values generated)
(1,804 missing values generated)
(1,820 missing values generated)
(1,856 missing values generated)

. 
end of do-file

